<template>
	<q-page class="row items-center justify-center">
		<div class="text-body1">
			<div class="text-h5 text-center q-pt-xl">Добро пожаловать на Freeze Light - уникальный веб-сайт, который позволяет вам имитировать эффект длинной выдержки фотоаппарата в режиме реального времени. Наш инструмент предназначен для фотографов и любителей светового искусства, которые хотят создавать световые рисунки с помощью камеры вашего устройства.</div>
			<div class="flex flex-center q-my-lg">
				<q-btn color="primary" size="lg" to="main" label="START" />
			</div>
			<q-separator class="q-my-lg"/>
			<div class="text-h6 text-center">Функционал:</div>
			<ul>
				<li>
					<b>1. Имитатор длинной выдержки:</b><br/>
					Наш виртуальный инструмент позволяет вам использовать камеру вашего устройства для создания световых рисунков, имитируя эффект длинной выдержки.
				</li>
				<li>
					<b>2. Выбор камеры:</b><br/>
					Вы можете выбрать, какую камеру использовать для съемки: фронтальную или заднюю. Это дает вам гибкость в создании различных световых эффектов.
				</li>
				<li>
					<b>3. Таймер:</b><br/>
					Встроенный таймер автоматически запускается при включении режима выдержки и останавливается после завершения записи. Это помогает вам точно синхронизировать ваши действия с процессом съемки.
				</li>
				<li>
					<b>4. Предварительный просмотр:</b><br/>
					Получите мгновенный предварительный просмотр ваших световых рисунков. Это поможет вам экспериментировать с различными движениями и источниками света, чтобы добиться идеального результата.
				</li>
				<li>
					<b>5. Сохранение:</b><br/>
					Сохраните ваши лучшие световые рисунки для дальнейшего использования или анализа.
				</li>
			</ul>
			<q-separator class="q-my-lg"/>
			<div class="text-h6 text-center">Как это работает:</div>
			<ul>
				<li>1. Выберите, какую камеру использовать: фронтальную или заднюю.</li>
				<li>2. Таймер автоматически запустится при включении режима выдержки.</li>
				<li>3. Начните создавать световые рисунки, используя источники света и движения перед камерой.</li>
				<li>4. Таймер остановится после завершения записи.</li>
				<li>5. Посмотрите предварительный просмотр вашего рисунка.</li>
				<li>6. Сохраните результат и используйте его для настройки вашего фотоаппарата или для дальнейшего творчества.</li>
			</ul>
			<q-separator class="q-my-lg"/>
			<div class="text-h5 text-center">Freeze Light - это идеальный инструмент для тех, кто хочет экспериментировать с длинной выдержкой и световыми рисунками, не тратя время и ресурсы на многочисленные попытки. Попробуйте прямо сейчас и откройте для себя мир светового искусства!</div>
			<div class="flex flex-center q-my-lg">
				<q-btn color="primary" size="lg" to="main" label="START" />
			</div>
		</div>
	</q-page>
</template>

<script setup lang="ts">

</script>
